Repository: python/pootle-python-org-backup
Catalog: tmxes/pt/using.tmx
Source language: en
Languages: pt

source: in "Installing Python" in "`A Byte of Python <http://www.byteofpython.info>`_" by Swaroop C H, 2003
pt: em "Instalando Python (Installing Python)" em "`Um pouco de Python (A Byte of Python) <http://www.byteofpython.info>`_" de Swaroop C H, 2003

source: Alternative bundles
pt: Pacotes alternativos

source: Besides the standard CPython distribution, there are modified packages including additional functionality. The following is a list of popular versions and their key features:
pt: Além da distribuição CPython padrão, há pacotes modificados que incluem funcionalidades adicionais. A seguir está uma lista das versões populares e suas principais características:

source: Installer with multi-platform compatibility, documentation, PyWin32
pt: Instalador com compatibilidade multi-plataforma, documentação, PyWin32

source: Popular modules (such as PyWin32) with their respective documentation, tool suite for building extensible Python applications
pt: Módulos populares (como PyWin32) com suas respectivas documentações, suíte de ferramentas para construção de aplicações extensíveis em Python

source: Notice that these packages are likely to install *older* versions of Python.
pt: Note que esses pacotes geralmente instalam versões *antigas* do Python.

source: Configuring Python
pt: Configurando o Python

source: In order to run Python flawlessly, you might have to change certain environment settings in Windows.
pt: A fim de executar o Python perfeitamente, talvez você precise alterar algumas configurações de ambiente do Windows.

source: Excursus: Setting environment variables
pt: Extra: Definindo variáveis de ambiente

source: Windows has a built-in dialog for changing environment variables (following guide applies to XP classical view): Right-click the icon for your machine (usually located on your Desktop and called "My Computer") and choose :menuselection:`Properties` there. Then, open the :guilabel:`Advanced` tab and click the :guilabel:`Environment Variables` button.
pt: O Windows possui uma caixa de diálogo para alterar as variáveis de ambiente (o guia a seguir aplica-se a visão clássica do XP): Botão direito do mouse no ícone "Meu Computador" (geralmente localizado em seu Desktop) e lá escolha :menuselection:`Propriedades`. Em seguida, abra a aba :guilabel:`Avançado` e clique no botão :guilabel:`Variáveis de ambiente`.

source: In short, your path is:
pt: De modo simplificado, o caminho é:

source: :menuselection:`My Computer --> Properties --> Advanced --> Environment Variables`
pt: :menuselection:`Meu Computador --> Propriedades --> Avançado --> Variáveis de ambiente`

source: In this dialog, you can add or modify User and System variables. To change System variables, you need non-restricted access to your machine (i.e. Administrator rights).
pt: Nesas janela, você pode adicionar ou modificar as variáveis de Usuário e de Sistema. Para modificar as variáveis de Sistema, você precisa ter acesso irrestrito a sua máquina (ou seja, Direitos de Administrador).

source: Another way of adding variables to your environment is using the :command:`set` command::
pt: Outro jeito de adicionar variáveis ao ambiente é utilizando o comando :command:`set`::

source: set PYTHONPATH=%PYTHONPATH%;C:\My_python_lib
pt: set PYTHONPATH=%PYTHONPATH%;C:\Minha_biblioteca_python

source: To make this setting permanent, you could add the corresponding command line to your :file:`autoexec.bat`. :program:`msconfig` is a graphical interface to this file.
pt: Para que esta modificação seja permanente,você pode adicionar o comando anterior para seu :file:`autoexec.bat`. :program:`msconfig`é uma interface gráfica para esse arquivo.

source: Viewing environment variables can also be done more straight-forward: The command prompt will expand strings wrapped into percent signs automatically::
pt: As variáveis de ambiente também podem ser vistas de uma forma mais simples: O comando a seguir, quando executado no prompt de comando, irá transformar as palavras delimitadas pelo sinal % automaticamente::

source: Consult :command:`set /?` for details on this behaviour.
pt: Para mais informações, consulte :command:`set /?`.

source: Environment variables in Windows NT
pt: Variáveis de ambiente no Windows NT (Environment variables in Windows NT)

source: How To Manage Environment Variables in Windows XP
pt: Como Gerenciar as Variáveis de Ambiente no Windows XP (How To Manage Environment Variables in Windows XP)

source: Setting Environment variables, Louis J. Farrugia
pt: Configurando variáveis de Ambiente (Setting Environment variables), Louis J. Farrugia

source: Finding the Python executable
pt: Encontrando o executável Python

source: Besides using the automatically created start menu entry for the Python interpreter, you might want to start Python in the DOS prompt. To make this work, you need to set your :envvar:`%PATH%` environment variable to include the directory of your Python distribution, delimited by a semicolon from other entries. An example variable could look like this (assuming the first two entries are Windows' default)::
pt: Ao invés de utilizar a entrada criada automaticamente no menu iniciar para o interpretador Python, você pode querer iniciar o Python no prompt de comando DOS. Para que isto funcione, você precisar modificar a variável de ambiente :envvar:`%PATH%` incluindo o diretório de sua distribuição Python, separando o caminho dos outros caminhos já existentes com vírgula. Um exemplo de variável seria (considerando que as duas primeiras entradas são padrões do Windows)::

source: Typing :command:`python` on your command prompt will now fire up the Python interpreter. Thus, you can also execute your scripts with command line options, see :ref:`using-on-cmdline` documentation.
pt: Digitando :command:`python` no prompt de comando agora irá iniciar o interpretador Python. Assim, você também pode executar seus scripts com opções na linha de comando, veja a documentação em :ref:`using-on-cmdline`.

source: Finding modules
pt: Procurando módulos

source: Python usually stores its library (and thereby your site-packages folder) in the installation directory. So, if you had installed Python to :file:`C:\\Python\\`, the default library would reside in :file:`C:\\Python\\Lib\\` and third-party modules should be stored in :file:`C:\\Python\\Lib\\site-packages\\`.
pt: Python geralmente armazena sua biblioteca (e consequentemente sua pasta site-packages) no diretório de instalação. Então, se você instalou o Python em :file:`C:\Python\`, a biblioteca padrão estará em :file:`C:\Python\Lib\` e os módulos de terceiros devem estar em :file:`C:\Python\Lib\site-packages\`.

source: You can add folders to your search path to make Python's import mechanism search in these directories as well. Use :envvar:`PYTHONPATH`, as described in :ref:`using-on-envvars`, to modify :data:`sys.path`. On Windows, paths are separated by semicolons, though, to distinguish them from drive identifiers (:file:`C:\\` etc.).
pt: Você pode adicionar pastas para seu caminho de busca para fazer com que o mecanismo de importação do Python também busque nesses locais. Use :envvar:`PYTHONPATH`, como explicado em :ref:`using-on-envvars`, para modificar o :data:`sys.path`. No Windows, os caminhos são separados por vírgulas, para distinguí-los das identificações dos discos (:file:`C:\` etc.).

source: Modifying the module search path can also be done through the Windows registry under the key :file:`HKLM\\SOFTWARE\\Python\\PythonCore\\{version}\\PythonPath`. Subkeys which have semicolon-delimited path strings as their default value will cause each path to be searched. Multiple subkeys can be created and are appended to the path in alphabetical order. A convenient registry editor is :program:`regedit` (start it by typing "regedit" into :menuselection:`Start --> Run`).
pt: As modificações no caminho de busca por módulos também podem ser feitas pelo Registro do Windows, na chave :file:`HKLM\SOFTWARE\Python\PythonCore\{version}\PythonPath`. Subchaves que possuam os caminhos padrão delimitados por vírgula farão com que cada caminho citado seja buscado. Múltiplas subchaves podem ser criadas, sendo adicionadas ao caminho principal em ordem alfabética. Um recomendado editor de registro é o :program:`regedit` (para executá-lo, basta digitar "regedit" em :menuselection:`Iniciar --> Executar`).

source: Executing scripts
pt: Executando scripts

source: Python scripts (files with the extension ``.py``) will be executed by :program:`python.exe` by default. This executable opens a terminal, which stays open even if the program uses a GUI. If you do not want this to happen, use the extension ``.pyw`` which will cause the script to be executed by :program:`pythonw.exe` by default (both executables are located in the top-level of your Python installation directory). This suppresses the terminal window on startup.
pt: Os scripts Python (arquivos com a extenção ``.py``) serão executados pelo :program:`python.exe`por padrão. Esse executável abre um terminal, que permanece aberto mesmo que o programa utilize GUI (interface gráfica). Se você não quer que isso aconteça, use a extenção ``.pyw``, que fará com que o script seja executado pelo :program:`pythonw.exe` por padrão (ambos executáveis estão localizados pasta raiz da instalação do Python). Isto esconde a janela do terminal na execução.

source: You can also make all ``.py`` scripts execute with :program:`pythonw.exe`, setting this through the usual facilities, for example (might require administrative rights):
pt: Você também pode fazer com que todos os scripts ``.py`` sejam executados pelo :program:`pythonw.exe`, configurando isto da forma usual, por exemplo (talvez requeira direitos de administrador):

source: Launch a command prompt.
pt: Inicie um prompt de comando.

source: Associate the correct file group with ``.py`` scripts::
pt: Associe o grupo de arquivos correto com os scripts ``.py``::

source: Redirect all Python files to the new executable::
pt: Redirecione todos os arquivos Python para o novo executável::

source: Additional modules
pt: Módulos adicionais

source: Even though Python aims to be portable among all platforms, there are features that are unique to Windows. A couple of modules, both in the standard library and external, and snippets exist to use these features.
pt: Mesmo que o Python objetive ser portável entre todas plataformas, existem características que são únicas do Windows. Alguns módulos, tanto na biblioteca padrão quanto externa, e trechos de código existem para utilizar essas características.

source: The Windows-specific standard modules are documented in :ref:`mswin-specific-services`.
pt: Os módulos padrões específicos do Windows estão documentados em :ref:`mswin-specific-services`.

source: The `PyWin32 <http://python.net/crew/mhammond/win32/>`_ module by Mark Hammond is a collection of modules for advanced Windows-specific support. This includes utilities for:
pt: O módulo `PyWin32 <http://python.net/crew/mhammond/win32/>`_ de Mark Hammond é uma coletânea de módulos para suporte avançado no Windows. Inclui utilidades para:

source: `Component Object Model <http://www.microsoft.com/com/>`_ (COM)
pt: `Modelo Objeto-Componente (Component Object Model) <http://www.microsoft.com/com/>`_ (COM)

source: Win32 API calls
pt: Chamadas a API Win32 (Win32 API calls)

source: Registry
pt: Registro (Registry)

source: Event log
pt: Log de eventos (Event log)

source: `Microsoft Foundation Classes <http://msdn.microsoft.com/en-us/library/fe1cf721%28VS.80%29.aspx>`_ (MFC) user interfaces
pt: `Interfaces de usuário das Classes Microsoft (Microsoft Foundation Classes) <http://msdn.microsoft.com/en-us/library/fe1cf721%28VS.80%29.aspx>`_ (MFC)

source: `PythonWin <http://web.archive.org/web/20060524042422/ http://www.python.org/windows/pythonwin/>`_ is a sample MFC application shipped with PyWin32. It is an embeddable IDE with a built-in debugger.
pt: `PythonWin <http://web.archive.org/web/20060524042422/ http://www.python.org/windows/pythonwin/>`_ é uma aplicação exemplo MFC que vem com o PyWin32. É uma IDE com debugador interno.

source: by Tim Golden
pt: por Tim Golden

source: by David and Paul Boddie
pt: por David and Paul Boodie

source: `Py2exe <http://www.py2exe.org/>`_ is a :mod:`distutils` extension (see :ref:`extending-distutils`) which wraps Python scripts into executable Windows programs (:file:`{*}.exe` files). When you have done this, you can distribute your application without requiring your users to install Python.
pt: `Py2exe <http://www.py2exe.org/>`_ é uma extenção do :mod:`distutils` (veja :ref:`extending-distutils`) que transforma scripts Python em programas executáveis do Windows (arquivos :file:`{*}.exe`). Fazendo isso, você pode distribuir sua aplicação sem necessitar que os usuários possuam o Python instalado.

source: Since Python's advanced terminal handling layer, :mod:`curses`, is restricted to Unix-like systems, there is a library exclusive to Windows as well: Windows Console I/O for Python.
pt: Uma vez que a camada de manipulação avançada de terminal do Python, :mod:`curses`, é restrita a sistemas Unix e similares, existe uma biblioteca exclusiva para o Windows: Windows Console I/O para Python.

source: `WConio <http://newcenturycomputers.net/projects/wconio.html>`_ is a wrapper for Turbo-C's :file:`CONIO.H`, used to create text user interfaces.
pt: `WConio <http://newcenturycomputers.net/projects/wconio.html>`_ é um transformador para Turbo-C's :file:`CONIO.H`, utilizado para criar interfaces de texto para o usuário.

source: Compiling Python on Windows
pt: Compilando o Python no Windows

source: For Microsoft Visual C++, which is the compiler with which official Python releases are built, the source tree contains solutions/project files. View the :file:`readme.txt` in their respective directories:
pt: Para o Microsoft Visual C++, que é o compilador utilizado para as versões oficiais do Python, a árvore de arquivos fonte contém soluções/arquivos de projeto. Veja o :file:`readme.txt` nos respectivos diretórios:

source: Directory
pt: Diretório

source: MSVC version
pt: Versão do MSVC

source: Visual Studio version
pt: Versão do Visual Studio

source: Note that not all of these build directories are fully supported. Read the release notes to see which compiler version the official releases for your version are built with.
pt: Note que nem todos diretórios destas distribuições são totalmente suportados. Leia as notas do lançamento para ver qual versão do compilador foi utilizada para a construção.

source: Check :file:`PC/readme.txt` for general information on the build process.
pt: Veja :file:`PC/readme.txt` para informações gerais do processo de construção.

source: For extension modules, consult :ref:`building-on-windows`.
pt: Para módulos de extensão, consulte :ref:`building-on-windows`.

source: or "Creating Python extensions in C/C++ with SWIG and compiling them with MinGW gcc under Windows" or "Installing Python extension with distutils and without Microsoft Visual C++" by Sébastien Sauvage, 2003
pt: ou "Criando extensões em C/C++ com SWIG e compilando-as com MinGW gcc no Windows (Creating Python extensions in C/C++ with SWIG and compiling them with MinGW gcc under Windows)" ou "Instalando extensões Python com distutils sem Microsoft Visual C++ (Installing Python extension with distutils and without Microsoft Visual C++)" by Sébastien Sauvage, 2003

source: by Trent Apted et al, 2007
pt: por Trent Apted et al, 2007

source: Other resources
pt: Outros recursos

source: "Help for Windows Programmers" by Mark Hammond and Andy Robinson, O'Reilly Media, 2000, ISBN 1-56592-621-8
pt: "Ajuda para Programadores do Windows (Help for Windows Programmers)" por Mark Hammond e Andy Robinson, O'Reilly Media, 2000, ISBN 1-56592-621-8

source: by Amanda Birmingham, 2004
pt: por Amanda Birmingham, 2004
